In [8]:
# Importing libraries:

import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
from scipy.stats import stats
import statsmodels.api as sm
from statsmodels.formula.api import ols


pd.set_option('display.float_format', lambda x: f'{x:,.2f}')
sns.set(style='whitegrid', palette='pastel')

In [6]:
# Import Dataset

customer = pd.read_csv('customer_table.csv')
date = pd.read_csv('date_table.csv')
device = pd.read_csv('device_table.csv')
product = pd.read_csv('product_table.csv')
fact = pd.read_csv('fact_table.csv')

In [9]:
customer.head()  # Read first five rows of customer table

   customer_id customer_name  age  gender      city
0            1    Customer 1   49  Female    London
1            2    Customer 2   45    Male    London
2            3    Customer 3   51    Male    London
3            4    Customer 4   38    Male  New York
4            5    Customer 5   26    Male    London

In [10]:
date.head()  # Read first five rows of date table

   date_id      date
0        1  1/1/2023
1        2  1/2/2023
2        3  1/3/2023
3        4  1/4/2023
4        5  1/5/2023

In [11]:
device.head() # Read first five rows of device table

   device_id device_type       os
0          1      Tablet      iOS
1          2     Desktop      iOS
2          3      Mobile  Windows
3          4      Mobile  Android
4          5      Tablet      iOS

In [12]:
product.head()  # Read first five rows of product table

   product_id product_name     category    price
0           1       Laptop  Electronics 1,026.94
1           2   Smartphone  Electronics   641.94
2           3   Headphones  Electronics   866.21
3           4   Smartwatch  Electronics 1,221.77
4           5       Camera  Electronics 1,290.76

In [13]:
fact.head()     # Read first five rows of fact table

,session_id,customer_id,product_id,device_id,date_id,quantity,abandonment_time
0,1,979,20,5,252,4,7/13/2023
1,2,373,12,3,353,2,11/7/2023
2,3,32,3,4,286,2,3/3/2023
3,4,631,25,1,365,2,NaN
4,5,127,9,3,163,3,7/22/2023

In [14]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 366 entries, 0 to 365
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   date_id  366 non-null    int64
 1   date     366 non-null    object
dtypes: int64(1), object(1)
memory usage: 5.8+ KB

In [15]:
date['date']= pd.to_datetime(date['date'])
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 366 entries, 0 to 365
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   date_id  366 non-null    int64
 1   date     366 non-null    datetime64[ns]
dtypes: datetime64[ns](1), int64(1)
memory usage: 5.8 KB

In [16]:
# Considering only year 2023 for analysis

date = date[date['date'].dt.year==2023]

In [19]:
fact.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 7 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   session_id        5000 non-null   int64
 1   customer_id       5000 non-null   int64
 2   product_id        5000 non-null   int64
 3   device_id         5000 non-null   int64
 4   date_id           5000 non-null   int64
 5   quantity          5000 non-null   int64
 6   abandonment_time  2524 non-null   object
dtypes: int64(6), object(1)
memory usage: 273.6+ KB

In [20]:
fact['abandonment_time'] = pd.to_datetime(fact['abandonment_time'])
fact.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 7 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   session_id        5000 non-null   int64
 1   customer_id       5000 non-null   int64
 2   product_id        5000 non-null   int64
 3   device_id         5000 non-null   int64
 4   date_id           5000 non-null   int64
 5   quantity          5000 non-null   int64
 6   abandonment_time  2524 non-null   datetime64[ns]
dtypes: datetime64[ns](1), int64(6)
memory usage: 273.6 KB

In [21]:
fact.isnull().sum()

session_id             0
customer_id            0
product_id             0
device_id              0
date_id                0
quantity               0
abandonment_time    2476
dtype: int64

In [22]:
fact.duplicated().sum()

np.int64(0)

# Demographic insights

In [24]:
customer['customer_id'].count()

np.int64(1000)

In [ ]:
# City wise Customer Count